import React, { Component } from 'react';
import './form.less';

import axios from 'axios';
import Mock from 'mockjs';
import moment from 'moment';
import {Row, Col, Input, Icon, Cascader, DatePicker, Button ,Card, Table} from 'antd';

import address from './request/address.json';
import data from './request/data.json';

import BreadcrumbCustom from '../common/BreadcrumbCustom';
import './SearchPage.less';

axios.defaults.withCredentials = true;
axios.defaults.headers.post['Content-Type'] = 'application/json';

const { Meta } = Card;


const Search = Input.Search;
const InputGroup = Input.Group;
const options = [];
const { RangePicker } = DatePicker;
Mock.mock('/address', address);
Mock.mock('/data', data);

var flag=false

let result=[
    {
        "id": 0,
        "url": "https://maoyan.com/films/1215829",
        "title": "尺八·一声一世",
        "other-title": "One Sound, One Life",
        "category": [
            "纪录片",
            "音乐"
        ],
        "release-location": "中国大陆",
        "length": 91,
        "release-date": 2019,
        "director": [
            "聿馨"
        ],
        "actor": [
            "佐藤康夫",
            "小凑昭尚",
            "蔡鸿文",
            "梁文道",
            "佐藤康夫",
            "小凑昭尚",
            "蔡鸿文",
            "梁文道",
            "陆川",
            "龚琳娜",
            "徐浩鹏",
            "海山",
            "三桥贵风",
            "星梵竹",
            "三塚信彦"
        ],
        "detail": "《尺八·一声一世》是聿馨导演历时三年拍摄的音乐人文纪录电影，片中记录了中日美等地的尺八演奏家，制管师，学习者的生活，通过他们的尺八之路，映照出每个人对音乐，生活，生命及世界的认知与感悟。为大众展现了生活的另一种可能。 尺八，是源于中国的竹制吹管乐器，因管长一尺八寸得名，音色苍凉辽阔，曾兴于盛唐，南宋后在中国式微，而在日本传承至今。如今作为《火影忍者》《阴阳师》等影视动漫配乐逐渐被中国年轻人所知。",
        "img": "https://p0.meituan.net/movie/0fcf11cd8dec7d63b4f840a9a096392b15161270.jpg@464w_644h_1e_1c",
        "rating": 8.3,
        "hot-extent": {
            "video_num": 3,
            "photo_num": 46,
            "rating_num": 29,
            "news_num": 5
        },
        "comment": [
            {
                "comment_text": "看哭我了！非常值得一看的电影，但要用心来看，只可惜偌大的影院就四个人再看，就上映一场，让我想到了电影《百鸟朝凤》",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "虽然我不是学音乐的，但是真的好听，声音直达内心深处，我觉得比什么复仇者联盟好看多了",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "很喜欢，尺八的声音悠长空灵，在长城上的那幕真的是给我震撼",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "空灵  寂静\n似乎穿越千年\n又如同来自灵魂深处\n在听到的那一刹那\n泪水便划过脸庞\n崔健曾说，很多充斥耳边的音乐只能称为之噪音\n而尺八 绝对是能震撼心灵的那种\n演奏的背后是人\n小凑昭尚说，尺八是救赎和感恩\n佐藤康夫说，尺八更重要的意义在于和不同的人相遇\n而对于观影的我\n似乎在那苍凉古朴的乐音中\n听到了宇宙的瞬间与永久 生命的极致与无常\n如果你所想的不是安稳和地位，而是带着热爱和专注做事，很多有趣的事就会随之而来。\n看完电影，始终记得的是这句话。",
                "comment_time": "2019-6-22",
                "comment_rate": 9
            },
            {
                "comment_text": "尺八：一声一世   纪录片中的尺八古乐器，以一种震撼人心而又渊远流长音色冲洗着现代人们焦急，烦躁的内心，使人能够闭上眼睛，静静的聆听着古韵中表达出的自然之境以及人的情感，这个已经离家一千多年亲人再次重新回到了我们中国人的视线里，我们能否留住这个本就是属于我们中国人的文化吗，答案是可以的！我们的传统，我们中国的古音乐，难道有比中国人更了解中国的吗？我们的历史很长，我们的文化很多，我们是否要从那浮夸的现代文化中回回头，看看我们是否有一些更值得我们去守护的东西，我相信我们所有人都不会让他人再从我们这里夺走我们要守护的传统文化，我希望和我有同样感想的人能与我一起支持，守护咱们中国人的古文化",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "10分，为了佐藤康夫......\n片子里一些不怎么和谐的地方，感觉有点不纯粹......",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "当我们失去了文化，再试图重新找回。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "尺八的底色是悲沧的，听尺八有种被瞬间电击之感，肃杀之气，幽微之情都在它的音声之中。\n电影里中出现了很多动人的音乐，小奏昭尚为悼念已故队长踏上长城斑驳的城砖，专程为故友吹奏一曲《晚霞》，悠扬的尺八击破天光，在山岭和城垣之间回旋飘荡，仿佛贯穿此时与此刻，声音的尽头抵达永恒的彼岸。佐藤康夫在西安青龙寺演奏的《一聲一世》苍凉有力，回转悠扬，这个古老的乐器让横跨千年的人彼此相遇，在不同的时间做着同样的事。\n希望我们都能如电影里的演奏家，尺八制管师一样，憧憬生命里的纯粹与笃定。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "看过的电影不多不少，但第一次给满分，因为没有浪费我的一秒钟，也没有浪费我的一分钱！配乐非常好听，剧中每个人的故事也令人非常温暖和感动！！强烈推荐，值得一看！！！",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "“一切很圆满是不能诞生作品的。”\n\n这一场没几个人，但是片子播完了，没有一个人离场，静静听完了片尾曲大家才陆续起身。片尾曲是《一声一世》，身侧的女士说这个片尾曲是这部片子真正的精华。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "作为音乐纪录片而言，整个观影过程相当享受，尺八演奏真是太好听了啊啊啊啊！！！满足了我所有能产生好感的点，和风音乐，物哀，匠心，传承，中日文化渊源。小凑昭尚在长城吹奏那一段，“因为想要保护什么，坚定而温柔”，真是深得我心。只不过缺陷太致命，前三章还能寻着个脉络，现状，起源，工匠，传承，第4和5章就不知所云、夹带私货了，油腻的导演朋友圈看不出放进来的必要，还有炫耀之嫌。",
                "comment_time": "2019-6-24",
                "comment_rate": 8.0
            },
            {
                "comment_text": "一件不曾知晓的传统乐器及其天籁之音，并窥见日本传统艺人生存的现状。本来，一部纪录片没什么好多说的，不过龚琳娜的段落让本人想起了洛桑：“啊~我的太阳，一边放羊一边把歌唱······”",
                "comment_time": "2019-6-19",
                "comment_rate": null
            },
            {
                "comment_text": "千年前失传于中国，千年后开花于日本，我们没必要觉得不好意思，反而要庆幸它没从这个世界上消失才对。",
                "comment_time": "2019-6-7",
                "comment_rate": 7.9
            },
            {
                "comment_text": "一尺八，一世界，一人生。一部挺成功的纪录片，向更广阔的人群安利了这一特殊介质和文化，反正我是很想听一次现场演奏了。尺八穿越千年而来，跨国、跨民族、跨界、跨时代，渡人无数，但知之者甚少。片中那一段段叙述，传递着尺八传承者、教育者、研究者、制作者、演奏者、学习者、欣赏者的执着与陶醉，爱在此间弥漫，具有温柔却强劲的感染力。虽然他们有着不同的生活，但是都相信自己有更高的境界，尺八是帮助他们超脱的“神器”。",
                "comment_time": "2019-6-6",
                "comment_rate": 9.0
            },
            {
                "comment_text": "90分钟把尺八的前世今生基本讲清楚了，就像麋鹿一样，原产中华，因为种种原因绝迹，后来想恢复只能从域外引进。只不过音乐艺术这种东西想要恢复更难，何况其在扶桑也是传承艰难。无论如何，尚能在世间亲聆这绝美乐音，也算幸事一桩了",
                "comment_time": "2019-6-3",
                "comment_rate": 8.0
            }
        ]
    },
    {
        "id": 1,
        "url": "https://maoyan.com/films/1204589",
        "title": "绝杀慕尼黑",
        "other-title": "Движение вверх",
        "category": [
            "剧情",
            "运动"
        ],
        "release-location": "俄罗斯",
        "length": 121,
        "release-date": 2019,
        "director": [
            "安东·梅格尔季切夫"
        ],
        "actor": [
            "弗拉基米尔·马什科夫",
            "约翰·萨维奇",
            "伊万·科列斯尼科夫",
            "基里尔·扎耶采夫"
        ],
        "detail": "电影根据体育历史中著名的传奇真实事件改编，讲述了1972年慕尼黑奥运会篮球决赛中，前苏联篮球队打败了保持了36年全胜纪录的美国队的传奇故事。在决赛结束前三秒钟，美国队以一分优势领先。美国队已经开始提前庆祝比赛的胜利了，因为他们相信比赛结果已成定局。然而，一位来自苏联的不知名篮球教练，率领着艰难、困苦、贫穷中的苏联国家队，比赛结果发生逆转，整个篮球历史也发生了改变。",
        "img": "https://p0.meituan.net/movie/67044d5479f075a18adba35571cadc4f978021.jpg@464w_644h_1e_1c",
        "rating": 8.8,
        "hot-extent": {
            "video_num": 7,
            "photo_num": 88,
            "rating_num": 791,
            "news_num": 25
        },
        "comment": [
            {
                "comment_text": "去电影院里看场篮球赛吧。\n感受一下篮球的最大魅力：\n\n不到最后一秒你不知道谁才是赢家，以及没有什么不可能。\n\n电影最后三秒的绝杀简直让人心潮澎湃热血沸腾，想起了06年世锦赛王仕鹏最后5.8秒的三分球绝杀斯洛文尼亚，还有最近莱昂纳德精彩绝伦的绝杀，让多伦多猛龙以92比90险胜76人，以总比分4比3昂首挺进东部决赛书写历史。帅炸。\n以及电影最后那句“活着才一切皆有可能”，瞬间也可老泪纵横。\n有时候，一部电影，一场比赛一句台词就够了。\n          ——《绝杀慕尼黑》有感",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "太刺激了 后面忍不住鼓掌，然后鼓掌了还有观众迎合一起鼓掌。简直太激烈了",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "实在是太燃了，我一个对篮球完全没兴趣的看得热血沸腾",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "比《飞驰人生》强一百万倍！苏联队最后3秒逆转绝杀制胜美国队，尽管都知结局，但没想到如此一波三折、爆燃激动，儿子重病的教练、心脏病想放弃女友的队员、腿伤的10号核心、想叛逃某人，俄罗斯官僚带来压力，艰难困难时期的苏联折射，各类球迷都很幽默逗比，各种山穷水尽峰回路转，《夺命地铁》导演一气呵成震撼技巧超赞！“我打球的时候立陶宛整个街道都空无一人”",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "去TM的**政治，冷战，我是运动员！\n看完电影真TM想爆一句粗口。\n超燃的电影，特别最后的3秒钟，去裁判席投诉抗议的时候，最后一秒钟走完了，当全世界都认为他们输了，就连他们自己也这般认为，观众在欢呼庆祝，对手在欢呼庆祝，但是那个混蛋没有，那个混蛋光头教练没有，他依旧在抗议那本该给的三秒钟没有给，那个混蛋还真TM的给力，这才是TM体育精神，这才是一个运动员该有的基本素质——拼搏、永不言弃！\n本想说说当时前苏联的各种心酸，还有国际的紧张，那时候是冷战时期，但看到最后谁TM还关心政治，让TM的政治滚蛋吧，我只是个热爱运动、热爱篮球的人。\n提议，这部电影最适合跟最好的朋友组团去看。",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "真是太好看了，真的赞，特别是最后3秒长传底线2分苏联绝杀美国，最后的几秒里的时间剧情太煎熬，结局制造太悬念，还有就是美国街头那几个黑人小伙😂😂😂，赢了苏联人，苏联人又赢了美国队，所以他们才是最厉害的😂😂😂",
                "comment_time": "2019-6-21",
                "comment_rate": 9
            },
            {
                "comment_text": "体育竞技题材和歌舞片一样，都适合在影院观看。将配乐对于气氛的烘托最大化，才算真正意义上的观看了这部影片。\n \n本身便极具看点的素材加上曲折的比赛结果，故事在剧情上并不平淡，而俄罗斯电影人值得称赞的地方在于他们对于这次事件的加工处理极具火候。黑色幽默和紧张氛围之间的调度平衡、对前苏联官员的自黑也颇有力度，最为厉害的还是节奏的把控。\n\n最后，让我印象深刻的一个细节：前苏联老教练因为带球队输了一场比赛而离开球队，在和球员告别的时候，篮协的官员站在了篮球场边线内，作为新教练的加兰任拉住了篮协官员，把他拉到了身边，站在了边线外面。\n\n你在和你的队员告别，篮球场的每一寸都属于你，我只在篮球场外等候。",
                "comment_time": "2019-6-22",
                "comment_rate": 8
            },
            {
                "comment_text": "一段真实的历史，让人畅快淋漓，不能说毛子在黑美帝，而是确有其事，美帝脏还是出名的，这部类似卡特教练的路数，但是风格却不一样，这部注重于在球赛的表现上，在当中队员们相互成长，最重要的还是一个国家的荣耀！",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "太好看，激动的我手舞足蹈！！ 希望能票房大卖！！  那个教练，演的太好。  一个教练其实就是一个家长。 每个孩子都有自己的性格，和特长。 能把一个队伍带好，真不容易。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "激动人心，全无冷场，佳片；飾演教练那位仁兄，人品好極，征服了整支球队成员，赢尽人心，队员也被他感动，个个为他拼命。所以一个将领，是何等重要！",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "燃而历史，严肃而活泼，集体而个人，自黑又骄傲。",
                "comment_time": "2019-7-7",
                "comment_rate": 9.0
            },
            {
                "comment_text": "美国队不可战胜的神话，还是可以打破的。。。",
                "comment_time": "2019-7-6",
                "comment_rate": 7.0
            },
            {
                "comment_text": "大量的切镜和运动镜头，机位设定低，拍3/4个身子，最后3秒环绕全场的长镜头。弥补了一切非专业运动员还原经典的不足，漂亮。",
                "comment_time": "2019-7-4",
                "comment_rate": 8.0
            },
            {
                "comment_text": "非常燃~",
                "comment_time": "2019-7-4",
                "comment_rate": 9.0
            },
            {
                "comment_text": "镜头运用感觉棒，俄国片的笑点有点猝不及防。还有，在电影里面塞了场近乎完整的比赛，牛逼！",
                "comment_time": "2019-7-4",
                "comment_rate": 8.7
            }
        ]
    },
    {
        "id": 2,
        "url": "https://maoyan.com/films/1218727",
        "title": "何以为家",
        "other-title": "كفرناحوم",
        "category": [
            "剧情"
        ],
        "release-location": "黎巴嫩,法国,美国",
        "length": 116,
        "release-date": 2019,
        "director": [
            "娜丁·拉巴基",
            "Sameer Asha Patil"
        ],
        "actor": [
            "赞恩·阿尔·拉菲亚",
            "约丹诺斯·希费罗",
            "博鲁瓦蒂夫·特雷杰·班科尔"
        ],
        "detail": "法庭上，十二岁的男孩赞恩（赞恩·阿尔·拉菲亚 饰）向法官状告他的亲生父母，原因是，他们给了他生命。是什么样的经历让一个孩子做出如此不可思议的举动？故事中，赞恩的父母在无力抚养和教育的状况下依然不停生育，作为家中的长子赞恩，弱小的肩膀承担了无数生活的重压。当妹妹被强行卖给商贩为妻时，赞恩愤怒离家，之后遇到一对没有合法身份的母子，相互扶持勉强生活。然而生活并没有眷顾赞恩，重重磨难迫使他做出了令人震惊的举动……",
        "img": "https://p1.meituan.net/movie/d28b729ffe72353a72d1e7ef8a9b90591544978.jpg@464w_644h_1e_1c",
        "rating": 8.9,
        "hot-extent": {
            "video_num": 7,
            "photo_num": 94,
            "rating_num": 649,
            "news_num": 24
        },
        "comment": [
            {
                "comment_text": "电影《何以为家》的故事乍看荒诞至极，但当我真的看完这部电影，却又会被电影中在赤贫环境里生长的孩子，他悲惨的境遇所动容，会因此陷入耐人寻味的深思，这个世界最为弥足珍贵的羁绊是亲情，但并不是每一个能生下孩子的人都有资格成为父母，拍给生育癌的电影，当人类的生育只是本能，却不想为孩子的以后负责任",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "这种穷苦，可能小时候看的妈妈再爱我一次，有类似的揪心感，不过结尾我喜欢，直接加到五星！真心希望全世界（没有能力）的人们充分理解这点基本的道理并付诸于现实！导演很有思想也能侃，希望这样的女性越来越多",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "看看现实中小男孩的经历，挽救的只是芸芸众生的个体，还有更多在苦难中挣扎的家庭，不知前路\n上帝是公平的，拿走你一样东西，会再给你一样东西，呵呵",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "一直震惊于这到底是演技还是真实生活还原而完全出戏……强烈关注这孩子的下一部作品\n充斥着破败肮脏的环境，一面骂着生活就是**，一面呈现出那么多温暖人心的场面——为妹妹清洗内裤、扒开游乐场雕像的外衣、吹偷来的生日蛋糕上的蜡烛、支起窗户给黑人弟弟看动画片、给动画片配音、赚钱梦想着去瑞典……虽然结尾部分有些凌乱，但Zain的演出太戳心窝子了.",
                "comment_time": "2019-6-20",
                "comment_rate": 3
            },
            {
                "comment_text": "结局剧作稍显刻意，小男孩演技炸裂。西方视角的国家苦难题材，我们要有勇气展示我们社会的阴暗面，也要有勇气解决社会问题，不是拍出了社会问题就结束了",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "幸福不是理所当然的，不幸才是，我很惊讶导演的调度能力，还有镜头的运用，更惊讶这个主演是哪扒拉出来的，简直是天才",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "大晚上的就不该看这种沉重的电影 如果不是剧情，我很难想象得到一位十二岁的男孩会在法庭上公开起诉自己的亲生父母，理由是把他带来了这个世界…这部时长两个小时的电影里，还没有性意识的女童被家长卖出去当别人的媳妇、外来移民每天小心翼翼地生活在城市的最阴暗处，是怎样的家庭关系会逼迫一个孩子离家出走甚至和一对素未谋面的贫困单亲母子生活还感觉更加幸福？ 影片中，偷渡移民想抬起头需要证件，孩子进医院治疗需要证件…那当父母为何不要资格证？ 我很庆幸我所生活的环境、我有我爱的以及爱我的家人！",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "希望每个孩子都不要承受这样的痛苦！这是今年最值得看的一部电影。被小赞恩赚走的不仅仅是眼泪，还有直击心灵的震撼，希望那些不幸的孩子，尤其是正在制造不幸的家长能够看到这部影片，能够改变。当然更希望没有任何人在这部电影里面看到自己！",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "在电影的世界还原苦难，在电影以外的世界创造奇迹，导演生猛的视听处理让这个极其压抑和悲情的故事极具情感的震撼力和张力，并且以一种悬疑片的叙事结构抽丝剥茧地展现着地狱般的现实，你很难不被如此的故事打动，尤其小男主演曾经也是如此故事的主角，那种眼神中的沧桑是影片最让人心碎的力量\r拉巴基对社会问题表达毫不拖泥带水，以男孩Zain视角撕开羁绊全世界的伤疤。Zain的生活真的好苦，他的经历让我有一丝绝望",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "十二岁的孩子将父母告上法庭，所控诉的是父母给予了自已以生命，小男孩的情感表达很直接，每一次没有选择境地下的选择都是惨烈；父母在法庭的托辞很直接，“不是我的问题是社会的错”，又怀孕时的理所当然，令人毛骨悚然，赞恩真的有张天使颜  WAP",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "作为主人公是不幸的，生在难民的家庭，父母将孩子生下，但是生活中又无力关爱照顾，更像持续生活的工具，小小年纪承受了太多，但扮演者又是幸运的，在帮助下和家人前往挪威生活",
                "comment_time": "2019-7-6",
                "comment_rate": 7.9
            },
            {
                "comment_text": "颠沛流离的生活就像泥淖，紧紧地把人吸住，孩子们期待能像鸟儿一样无忧无虑自在飞翔，可第二天醒来后发现这糟糕的生活毫无改观地继续残喘着，连一丝涟漪都不会泛起，我想这就是他们眼中的绝望吧。导演在本片中大量使用了摇晃镜头，把人物的不安定感传递给了观众，在多处场景中采用过度曝光，使整个画面产生了虚幻的暖色朦胧感，也给冷色调的故事蒙上了些许温存。本片最大亮点在于小演员的发挥，自然真实不做作，最后才知原来他就是经历者，望永无战乱。",
                "comment_time": "2019-7-6",
                "comment_rate": 7.9
            },
            {
                "comment_text": "一个离家的男孩，一个偷渡的母亲，一个没家的国家。想不到这张海报，竟是整部片中最温馨的表情。。。",
                "comment_time": "2019-7-5",
                "comment_rate": 7.0
            },
            {
                "comment_text": "哭了",
                "comment_time": "2019-7-5",
                "comment_rate": 9.0
            },
            {
                "comment_text": "初为人父，感触颇深",
                "comment_time": "2019-7-5",
                "comment_rate": 7.0
            }
        ]
    },
    {
        "id": 3,
        "url": "https://maoyan.com/films/1204589",
        "title": "绝杀慕尼黑",
        "other-title": "Движение вверх",
        "category": [
            "剧情",
            "运动"
        ],
        "release-location": "俄罗斯",
        "length": 121,
        "release-date": 2019,
        "director": [
            "安东·梅格尔季切夫"
        ],
        "actor": [
            "弗拉基米尔·马什科夫",
            "约翰·萨维奇",
            "伊万·科列斯尼科夫",
            "基里尔·扎耶采夫"
        ],
        "detail": "电影根据体育历史中著名的传奇真实事件改编，讲述了1972年慕尼黑奥运会篮球决赛中，前苏联篮球队打败了保持了36年全胜纪录的美国队的传奇故事。在决赛结束前三秒钟，美国队以一分优势领先。美国队已经开始提前庆祝比赛的胜利了，因为他们相信比赛结果已成定局。然而，一位来自苏联的不知名篮球教练，率领着艰难、困苦、贫穷中的苏联国家队，比赛结果发生逆转，整个篮球历史也发生了改变。",
        "img": "https://p0.meituan.net/movie/67044d5479f075a18adba35571cadc4f978021.jpg@464w_644h_1e_1c",
        "rating": 8.8,
        "hot-extent": {
            "video_num": 7,
            "photo_num": 88,
            "rating_num": 791,
            "news_num": 25
        },
        "comment": [
            {
                "comment_text": "去电影院里看场篮球赛吧。\n感受一下篮球的最大魅力：\n\n不到最后一秒你不知道谁才是赢家，以及没有什么不可能。\n\n电影最后三秒的绝杀简直让人心潮澎湃热血沸腾，想起了06年世锦赛王仕鹏最后5.8秒的三分球绝杀斯洛文尼亚，还有最近莱昂纳德精彩绝伦的绝杀，让多伦多猛龙以92比90险胜76人，以总比分4比3昂首挺进东部决赛书写历史。帅炸。\n以及电影最后那句“活着才一切皆有可能”，瞬间也可老泪纵横。\n有时候，一部电影，一场比赛一句台词就够了。\n          ——《绝杀慕尼黑》有感",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "太刺激了 后面忍不住鼓掌，然后鼓掌了还有观众迎合一起鼓掌。简直太激烈了",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "实在是太燃了，我一个对篮球完全没兴趣的看得热血沸腾",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "比《飞驰人生》强一百万倍！苏联队最后3秒逆转绝杀制胜美国队，尽管都知结局，但没想到如此一波三折、爆燃激动，儿子重病的教练、心脏病想放弃女友的队员、腿伤的10号核心、想叛逃某人，俄罗斯官僚带来压力，艰难困难时期的苏联折射，各类球迷都很幽默逗比，各种山穷水尽峰回路转，《夺命地铁》导演一气呵成震撼技巧超赞！“我打球的时候立陶宛整个街道都空无一人”",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "去TM的**政治，冷战，我是运动员！\n看完电影真TM想爆一句粗口。\n超燃的电影，特别最后的3秒钟，去裁判席投诉抗议的时候，最后一秒钟走完了，当全世界都认为他们输了，就连他们自己也这般认为，观众在欢呼庆祝，对手在欢呼庆祝，但是那个混蛋没有，那个混蛋光头教练没有，他依旧在抗议那本该给的三秒钟没有给，那个混蛋还真TM的给力，这才是TM体育精神，这才是一个运动员该有的基本素质——拼搏、永不言弃！\n本想说说当时前苏联的各种心酸，还有国际的紧张，那时候是冷战时期，但看到最后谁TM还关心政治，让TM的政治滚蛋吧，我只是个热爱运动、热爱篮球的人。\n提议，这部电影最适合跟最好的朋友组团去看。",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "真是太好看了，真的赞，特别是最后3秒长传底线2分苏联绝杀美国，最后的几秒里的时间剧情太煎熬，结局制造太悬念，还有就是美国街头那几个黑人小伙😂😂😂，赢了苏联人，苏联人又赢了美国队，所以他们才是最厉害的😂😂😂",
                "comment_time": "2019-6-21",
                "comment_rate": 9
            },
            {
                "comment_text": "体育竞技题材和歌舞片一样，都适合在影院观看。将配乐对于气氛的烘托最大化，才算真正意义上的观看了这部影片。\n \n本身便极具看点的素材加上曲折的比赛结果，故事在剧情上并不平淡，而俄罗斯电影人值得称赞的地方在于他们对于这次事件的加工处理极具火候。黑色幽默和紧张氛围之间的调度平衡、对前苏联官员的自黑也颇有力度，最为厉害的还是节奏的把控。\n\n最后，让我印象深刻的一个细节：前苏联老教练因为带球队输了一场比赛而离开球队，在和球员告别的时候，篮协的官员站在了篮球场边线内，作为新教练的加兰任拉住了篮协官员，把他拉到了身边，站在了边线外面。\n\n你在和你的队员告别，篮球场的每一寸都属于你，我只在篮球场外等候。",
                "comment_time": "2019-6-22",
                "comment_rate": 8
            },
            {
                "comment_text": "一段真实的历史，让人畅快淋漓，不能说毛子在黑美帝，而是确有其事，美帝脏还是出名的，这部类似卡特教练的路数，但是风格却不一样，这部注重于在球赛的表现上，在当中队员们相互成长，最重要的还是一个国家的荣耀！",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "太好看，激动的我手舞足蹈！！ 希望能票房大卖！！  那个教练，演的太好。  一个教练其实就是一个家长。 每个孩子都有自己的性格，和特长。 能把一个队伍带好，真不容易。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "激动人心，全无冷场，佳片；飾演教练那位仁兄，人品好極，征服了整支球队成员，赢尽人心，队员也被他感动，个个为他拼命。所以一个将领，是何等重要！",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "燃而历史，严肃而活泼，集体而个人，自黑又骄傲。",
                "comment_time": "2019-7-7",
                "comment_rate": 9.0
            },
            {
                "comment_text": "美国队不可战胜的神话，还是可以打破的。。。",
                "comment_time": "2019-7-6",
                "comment_rate": 7.0
            },
            {
                "comment_text": "大量的切镜和运动镜头，机位设定低，拍3/4个身子，最后3秒环绕全场的长镜头。弥补了一切非专业运动员还原经典的不足，漂亮。",
                "comment_time": "2019-7-4",
                "comment_rate": 8.0
            },
            {
                "comment_text": "非常燃~",
                "comment_time": "2019-7-4",
                "comment_rate": 9.0
            },
            {
                "comment_text": "镜头运用感觉棒，俄国片的笑点有点猝不及防。还有，在电影里面塞了场近乎完整的比赛，牛逼！",
                "comment_time": "2019-7-4",
                "comment_rate": 8.7
            }
        ]
    },
    {
        "id": 4,
        "url": "https://maoyan.com/films/1204589",
        "title": "绝杀慕尼黑",
        "other-title": "Движение вверх",
        "category": [
            "剧情",
            "运动"
        ],
        "release-location": "俄罗斯",
        "length": 121,
        "release-date": 2019,
        "director": [
            "安东·梅格尔季切夫"
        ],
        "actor": [
            "弗拉基米尔·马什科夫",
            "约翰·萨维奇",
            "伊万·科列斯尼科夫",
            "基里尔·扎耶采夫"
        ],
        "detail": "电影根据体育历史中著名的传奇真实事件改编，讲述了1972年慕尼黑奥运会篮球决赛中，前苏联篮球队打败了保持了36年全胜纪录的美国队的传奇故事。在决赛结束前三秒钟，美国队以一分优势领先。美国队已经开始提前庆祝比赛的胜利了，因为他们相信比赛结果已成定局。然而，一位来自苏联的不知名篮球教练，率领着艰难、困苦、贫穷中的苏联国家队，比赛结果发生逆转，整个篮球历史也发生了改变。",
        "img": "https://p0.meituan.net/movie/67044d5479f075a18adba35571cadc4f978021.jpg@464w_644h_1e_1c",
        "rating": 8.8,
        "hot-extent": {
            "video_num": 7,
            "photo_num": 88,
            "rating_num": 791,
            "news_num": 25
        },
        "comment": [
            {
                "comment_text": "去电影院里看场篮球赛吧。\n感受一下篮球的最大魅力：\n\n不到最后一秒你不知道谁才是赢家，以及没有什么不可能。\n\n电影最后三秒的绝杀简直让人心潮澎湃热血沸腾，想起了06年世锦赛王仕鹏最后5.8秒的三分球绝杀斯洛文尼亚，还有最近莱昂纳德精彩绝伦的绝杀，让多伦多猛龙以92比90险胜76人，以总比分4比3昂首挺进东部决赛书写历史。帅炸。\n以及电影最后那句“活着才一切皆有可能”，瞬间也可老泪纵横。\n有时候，一部电影，一场比赛一句台词就够了。\n          ——《绝杀慕尼黑》有感",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "太刺激了 后面忍不住鼓掌，然后鼓掌了还有观众迎合一起鼓掌。简直太激烈了",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "实在是太燃了，我一个对篮球完全没兴趣的看得热血沸腾",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "比《飞驰人生》强一百万倍！苏联队最后3秒逆转绝杀制胜美国队，尽管都知结局，但没想到如此一波三折、爆燃激动，儿子重病的教练、心脏病想放弃女友的队员、腿伤的10号核心、想叛逃某人，俄罗斯官僚带来压力，艰难困难时期的苏联折射，各类球迷都很幽默逗比，各种山穷水尽峰回路转，《夺命地铁》导演一气呵成震撼技巧超赞！“我打球的时候立陶宛整个街道都空无一人”",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "去TM的**政治，冷战，我是运动员！\n看完电影真TM想爆一句粗口。\n超燃的电影，特别最后的3秒钟，去裁判席投诉抗议的时候，最后一秒钟走完了，当全世界都认为他们输了，就连他们自己也这般认为，观众在欢呼庆祝，对手在欢呼庆祝，但是那个混蛋没有，那个混蛋光头教练没有，他依旧在抗议那本该给的三秒钟没有给，那个混蛋还真TM的给力，这才是TM体育精神，这才是一个运动员该有的基本素质——拼搏、永不言弃！\n本想说说当时前苏联的各种心酸，还有国际的紧张，那时候是冷战时期，但看到最后谁TM还关心政治，让TM的政治滚蛋吧，我只是个热爱运动、热爱篮球的人。\n提议，这部电影最适合跟最好的朋友组团去看。",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "真是太好看了，真的赞，特别是最后3秒长传底线2分苏联绝杀美国，最后的几秒里的时间剧情太煎熬，结局制造太悬念，还有就是美国街头那几个黑人小伙😂😂😂，赢了苏联人，苏联人又赢了美国队，所以他们才是最厉害的😂😂😂",
                "comment_time": "2019-6-21",
                "comment_rate": 9
            },
            {
                "comment_text": "体育竞技题材和歌舞片一样，都适合在影院观看。将配乐对于气氛的烘托最大化，才算真正意义上的观看了这部影片。\n \n本身便极具看点的素材加上曲折的比赛结果，故事在剧情上并不平淡，而俄罗斯电影人值得称赞的地方在于他们对于这次事件的加工处理极具火候。黑色幽默和紧张氛围之间的调度平衡、对前苏联官员的自黑也颇有力度，最为厉害的还是节奏的把控。\n\n最后，让我印象深刻的一个细节：前苏联老教练因为带球队输了一场比赛而离开球队，在和球员告别的时候，篮协的官员站在了篮球场边线内，作为新教练的加兰任拉住了篮协官员，把他拉到了身边，站在了边线外面。\n\n你在和你的队员告别，篮球场的每一寸都属于你，我只在篮球场外等候。",
                "comment_time": "2019-6-22",
                "comment_rate": 8
            },
            {
                "comment_text": "一段真实的历史，让人畅快淋漓，不能说毛子在黑美帝，而是确有其事，美帝脏还是出名的，这部类似卡特教练的路数，但是风格却不一样，这部注重于在球赛的表现上，在当中队员们相互成长，最重要的还是一个国家的荣耀！",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "太好看，激动的我手舞足蹈！！ 希望能票房大卖！！  那个教练，演的太好。  一个教练其实就是一个家长。 每个孩子都有自己的性格，和特长。 能把一个队伍带好，真不容易。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "激动人心，全无冷场，佳片；飾演教练那位仁兄，人品好極，征服了整支球队成员，赢尽人心，队员也被他感动，个个为他拼命。所以一个将领，是何等重要！",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "燃而历史，严肃而活泼，集体而个人，自黑又骄傲。",
                "comment_time": "2019-7-7",
                "comment_rate": 9.0
            },
            {
                "comment_text": "美国队不可战胜的神话，还是可以打破的。。。",
                "comment_time": "2019-7-6",
                "comment_rate": 7.0
            },
            {
                "comment_text": "大量的切镜和运动镜头，机位设定低，拍3/4个身子，最后3秒环绕全场的长镜头。弥补了一切非专业运动员还原经典的不足，漂亮。",
                "comment_time": "2019-7-4",
                "comment_rate": 8.0
            },
            {
                "comment_text": "非常燃~",
                "comment_time": "2019-7-4",
                "comment_rate": 9.0
            },
            {
                "comment_text": "镜头运用感觉棒，俄国片的笑点有点猝不及防。还有，在电影里面塞了场近乎完整的比赛，牛逼！",
                "comment_time": "2019-7-4",
                "comment_rate": 8.7
            }
        ]
    },
    {
        "id": 5,
        "url": "https://maoyan.com/films/1204589",
        "title": "绝杀慕尼黑",
        "other-title": "Движение вверх",
        "category": [
            "剧情",
            "运动"
        ],
        "release-location": "俄罗斯",
        "length": 121,
        "release-date": 2019,
        "director": [
            "安东·梅格尔季切夫"
        ],
        "actor": [
            "弗拉基米尔·马什科夫",
            "约翰·萨维奇",
            "伊万·科列斯尼科夫",
            "基里尔·扎耶采夫"
        ],
        "detail": "电影根据体育历史中著名的传奇真实事件改编，讲述了1972年慕尼黑奥运会篮球决赛中，前苏联篮球队打败了保持了36年全胜纪录的美国队的传奇故事。在决赛结束前三秒钟，美国队以一分优势领先。美国队已经开始提前庆祝比赛的胜利了，因为他们相信比赛结果已成定局。然而，一位来自苏联的不知名篮球教练，率领着艰难、困苦、贫穷中的苏联国家队，比赛结果发生逆转，整个篮球历史也发生了改变。",
        "img": "https://p0.meituan.net/movie/67044d5479f075a18adba35571cadc4f978021.jpg@464w_644h_1e_1c",
        "rating": 8.8,
        "hot-extent": {
            "video_num": 7,
            "photo_num": 88,
            "rating_num": 791,
            "news_num": 25
        },
        "comment": [
            {
                "comment_text": "去电影院里看场篮球赛吧。\n感受一下篮球的最大魅力：\n\n不到最后一秒你不知道谁才是赢家，以及没有什么不可能。\n\n电影最后三秒的绝杀简直让人心潮澎湃热血沸腾，想起了06年世锦赛王仕鹏最后5.8秒的三分球绝杀斯洛文尼亚，还有最近莱昂纳德精彩绝伦的绝杀，让多伦多猛龙以92比90险胜76人，以总比分4比3昂首挺进东部决赛书写历史。帅炸。\n以及电影最后那句“活着才一切皆有可能”，瞬间也可老泪纵横。\n有时候，一部电影，一场比赛一句台词就够了。\n          ——《绝杀慕尼黑》有感",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "太刺激了 后面忍不住鼓掌，然后鼓掌了还有观众迎合一起鼓掌。简直太激烈了",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "实在是太燃了，我一个对篮球完全没兴趣的看得热血沸腾",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "比《飞驰人生》强一百万倍！苏联队最后3秒逆转绝杀制胜美国队，尽管都知结局，但没想到如此一波三折、爆燃激动，儿子重病的教练、心脏病想放弃女友的队员、腿伤的10号核心、想叛逃某人，俄罗斯官僚带来压力，艰难困难时期的苏联折射，各类球迷都很幽默逗比，各种山穷水尽峰回路转，《夺命地铁》导演一气呵成震撼技巧超赞！“我打球的时候立陶宛整个街道都空无一人”",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "去TM的**政治，冷战，我是运动员！\n看完电影真TM想爆一句粗口。\n超燃的电影，特别最后的3秒钟，去裁判席投诉抗议的时候，最后一秒钟走完了，当全世界都认为他们输了，就连他们自己也这般认为，观众在欢呼庆祝，对手在欢呼庆祝，但是那个混蛋没有，那个混蛋光头教练没有，他依旧在抗议那本该给的三秒钟没有给，那个混蛋还真TM的给力，这才是TM体育精神，这才是一个运动员该有的基本素质——拼搏、永不言弃！\n本想说说当时前苏联的各种心酸，还有国际的紧张，那时候是冷战时期，但看到最后谁TM还关心政治，让TM的政治滚蛋吧，我只是个热爱运动、热爱篮球的人。\n提议，这部电影最适合跟最好的朋友组团去看。",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "真是太好看了，真的赞，特别是最后3秒长传底线2分苏联绝杀美国，最后的几秒里的时间剧情太煎熬，结局制造太悬念，还有就是美国街头那几个黑人小伙😂😂😂，赢了苏联人，苏联人又赢了美国队，所以他们才是最厉害的😂😂😂",
                "comment_time": "2019-6-21",
                "comment_rate": 9
            },
            {
                "comment_text": "体育竞技题材和歌舞片一样，都适合在影院观看。将配乐对于气氛的烘托最大化，才算真正意义上的观看了这部影片。\n \n本身便极具看点的素材加上曲折的比赛结果，故事在剧情上并不平淡，而俄罗斯电影人值得称赞的地方在于他们对于这次事件的加工处理极具火候。黑色幽默和紧张氛围之间的调度平衡、对前苏联官员的自黑也颇有力度，最为厉害的还是节奏的把控。\n\n最后，让我印象深刻的一个细节：前苏联老教练因为带球队输了一场比赛而离开球队，在和球员告别的时候，篮协的官员站在了篮球场边线内，作为新教练的加兰任拉住了篮协官员，把他拉到了身边，站在了边线外面。\n\n你在和你的队员告别，篮球场的每一寸都属于你，我只在篮球场外等候。",
                "comment_time": "2019-6-22",
                "comment_rate": 8
            },
            {
                "comment_text": "一段真实的历史，让人畅快淋漓，不能说毛子在黑美帝，而是确有其事，美帝脏还是出名的，这部类似卡特教练的路数，但是风格却不一样，这部注重于在球赛的表现上，在当中队员们相互成长，最重要的还是一个国家的荣耀！",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "太好看，激动的我手舞足蹈！！ 希望能票房大卖！！  那个教练，演的太好。  一个教练其实就是一个家长。 每个孩子都有自己的性格，和特长。 能把一个队伍带好，真不容易。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "激动人心，全无冷场，佳片；飾演教练那位仁兄，人品好極，征服了整支球队成员，赢尽人心，队员也被他感动，个个为他拼命。所以一个将领，是何等重要！",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "燃而历史，严肃而活泼，集体而个人，自黑又骄傲。",
                "comment_time": "2019-7-7",
                "comment_rate": 9.0
            },
            {
                "comment_text": "美国队不可战胜的神话，还是可以打破的。。。",
                "comment_time": "2019-7-6",
                "comment_rate": 7.0
            },
            {
                "comment_text": "大量的切镜和运动镜头，机位设定低，拍3/4个身子，最后3秒环绕全场的长镜头。弥补了一切非专业运动员还原经典的不足，漂亮。",
                "comment_time": "2019-7-4",
                "comment_rate": 8.0
            },
            {
                "comment_text": "非常燃~",
                "comment_time": "2019-7-4",
                "comment_rate": 9.0
            },
            {
                "comment_text": "镜头运用感觉棒，俄国片的笑点有点猝不及防。还有，在电影里面塞了场近乎完整的比赛，牛逼！",
                "comment_time": "2019-7-4",
                "comment_rate": 8.7
            }
        ]
    },
    {
        "id": 6,
        "url": "https://maoyan.com/films/1204589",
        "title": "绝杀慕尼黑",
        "other-title": "Движение вверх",
        "category": [
            "剧情",
            "运动"
        ],
        "release-location": "俄罗斯",
        "length": 121,
        "release-date": 2019,
        "director": [
            "安东·梅格尔季切夫"
        ],
        "actor": [
            "弗拉基米尔·马什科夫",
            "约翰·萨维奇",
            "伊万·科列斯尼科夫",
            "基里尔·扎耶采夫"
        ],
        "detail": "电影根据体育历史中著名的传奇真实事件改编，讲述了1972年慕尼黑奥运会篮球决赛中，前苏联篮球队打败了保持了36年全胜纪录的美国队的传奇故事。在决赛结束前三秒钟，美国队以一分优势领先。美国队已经开始提前庆祝比赛的胜利了，因为他们相信比赛结果已成定局。然而，一位来自苏联的不知名篮球教练，率领着艰难、困苦、贫穷中的苏联国家队，比赛结果发生逆转，整个篮球历史也发生了改变。",
        "img": "https://p0.meituan.net/movie/67044d5479f075a18adba35571cadc4f978021.jpg@464w_644h_1e_1c",
        "rating": 8.8,
        "hot-extent": {
            "video_num": 7,
            "photo_num": 88,
            "rating_num": 791,
            "news_num": 25
        },
        "comment": [
            {
                "comment_text": "去电影院里看场篮球赛吧。\n感受一下篮球的最大魅力：\n\n不到最后一秒你不知道谁才是赢家，以及没有什么不可能。\n\n电影最后三秒的绝杀简直让人心潮澎湃热血沸腾，想起了06年世锦赛王仕鹏最后5.8秒的三分球绝杀斯洛文尼亚，还有最近莱昂纳德精彩绝伦的绝杀，让多伦多猛龙以92比90险胜76人，以总比分4比3昂首挺进东部决赛书写历史。帅炸。\n以及电影最后那句“活着才一切皆有可能”，瞬间也可老泪纵横。\n有时候，一部电影，一场比赛一句台词就够了。\n          ——《绝杀慕尼黑》有感",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "太刺激了 后面忍不住鼓掌，然后鼓掌了还有观众迎合一起鼓掌。简直太激烈了",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "实在是太燃了，我一个对篮球完全没兴趣的看得热血沸腾",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "比《飞驰人生》强一百万倍！苏联队最后3秒逆转绝杀制胜美国队，尽管都知结局，但没想到如此一波三折、爆燃激动，儿子重病的教练、心脏病想放弃女友的队员、腿伤的10号核心、想叛逃某人，俄罗斯官僚带来压力，艰难困难时期的苏联折射，各类球迷都很幽默逗比，各种山穷水尽峰回路转，《夺命地铁》导演一气呵成震撼技巧超赞！“我打球的时候立陶宛整个街道都空无一人”",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "去TM的**政治，冷战，我是运动员！\n看完电影真TM想爆一句粗口。\n超燃的电影，特别最后的3秒钟，去裁判席投诉抗议的时候，最后一秒钟走完了，当全世界都认为他们输了，就连他们自己也这般认为，观众在欢呼庆祝，对手在欢呼庆祝，但是那个混蛋没有，那个混蛋光头教练没有，他依旧在抗议那本该给的三秒钟没有给，那个混蛋还真TM的给力，这才是TM体育精神，这才是一个运动员该有的基本素质——拼搏、永不言弃！\n本想说说当时前苏联的各种心酸，还有国际的紧张，那时候是冷战时期，但看到最后谁TM还关心政治，让TM的政治滚蛋吧，我只是个热爱运动、热爱篮球的人。\n提议，这部电影最适合跟最好的朋友组团去看。",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "真是太好看了，真的赞，特别是最后3秒长传底线2分苏联绝杀美国，最后的几秒里的时间剧情太煎熬，结局制造太悬念，还有就是美国街头那几个黑人小伙😂😂😂，赢了苏联人，苏联人又赢了美国队，所以他们才是最厉害的😂😂😂",
                "comment_time": "2019-6-21",
                "comment_rate": 9
            },
            {
                "comment_text": "体育竞技题材和歌舞片一样，都适合在影院观看。将配乐对于气氛的烘托最大化，才算真正意义上的观看了这部影片。\n \n本身便极具看点的素材加上曲折的比赛结果，故事在剧情上并不平淡，而俄罗斯电影人值得称赞的地方在于他们对于这次事件的加工处理极具火候。黑色幽默和紧张氛围之间的调度平衡、对前苏联官员的自黑也颇有力度，最为厉害的还是节奏的把控。\n\n最后，让我印象深刻的一个细节：前苏联老教练因为带球队输了一场比赛而离开球队，在和球员告别的时候，篮协的官员站在了篮球场边线内，作为新教练的加兰任拉住了篮协官员，把他拉到了身边，站在了边线外面。\n\n你在和你的队员告别，篮球场的每一寸都属于你，我只在篮球场外等候。",
                "comment_time": "2019-6-22",
                "comment_rate": 8
            },
            {
                "comment_text": "一段真实的历史，让人畅快淋漓，不能说毛子在黑美帝，而是确有其事，美帝脏还是出名的，这部类似卡特教练的路数，但是风格却不一样，这部注重于在球赛的表现上，在当中队员们相互成长，最重要的还是一个国家的荣耀！",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "太好看，激动的我手舞足蹈！！ 希望能票房大卖！！  那个教练，演的太好。  一个教练其实就是一个家长。 每个孩子都有自己的性格，和特长。 能把一个队伍带好，真不容易。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "激动人心，全无冷场，佳片；飾演教练那位仁兄，人品好極，征服了整支球队成员，赢尽人心，队员也被他感动，个个为他拼命。所以一个将领，是何等重要！",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "燃而历史，严肃而活泼，集体而个人，自黑又骄傲。",
                "comment_time": "2019-7-7",
                "comment_rate": 9.0
            },
            {
                "comment_text": "美国队不可战胜的神话，还是可以打破的。。。",
                "comment_time": "2019-7-6",
                "comment_rate": 7.0
            },
            {
                "comment_text": "大量的切镜和运动镜头，机位设定低，拍3/4个身子，最后3秒环绕全场的长镜头。弥补了一切非专业运动员还原经典的不足，漂亮。",
                "comment_time": "2019-7-4",
                "comment_rate": 8.0
            },
            {
                "comment_text": "非常燃~",
                "comment_time": "2019-7-4",
                "comment_rate": 9.0
            },
            {
                "comment_text": "镜头运用感觉棒，俄国片的笑点有点猝不及防。还有，在电影里面塞了场近乎完整的比赛，牛逼！",
                "comment_time": "2019-7-4",
                "comment_rate": 8.7
            }
        ]
    },
    {
        "id": 7,
        "url": "https://maoyan.com/films/1204589",
        "title": "绝杀慕尼黑",
        "other-title": "Движение вверх",
        "category": [
            "剧情",
            "运动"
        ],
        "release-location": "俄罗斯",
        "length": 121,
        "release-date": 2019,
        "director": [
            "安东·梅格尔季切夫"
        ],
        "actor": [
            "弗拉基米尔·马什科夫",
            "约翰·萨维奇",
            "伊万·科列斯尼科夫",
            "基里尔·扎耶采夫"
        ],
        "detail": "电影根据体育历史中著名的传奇真实事件改编，讲述了1972年慕尼黑奥运会篮球决赛中，前苏联篮球队打败了保持了36年全胜纪录的美国队的传奇故事。在决赛结束前三秒钟，美国队以一分优势领先。美国队已经开始提前庆祝比赛的胜利了，因为他们相信比赛结果已成定局。然而，一位来自苏联的不知名篮球教练，率领着艰难、困苦、贫穷中的苏联国家队，比赛结果发生逆转，整个篮球历史也发生了改变。",
        "img": "https://p0.meituan.net/movie/67044d5479f075a18adba35571cadc4f978021.jpg@464w_644h_1e_1c",
        "rating": 8.8,
        "hot-extent": {
            "video_num": 7,
            "photo_num": 88,
            "rating_num": 791,
            "news_num": 25
        },
        "comment": [
            {
                "comment_text": "去电影院里看场篮球赛吧。\n感受一下篮球的最大魅力：\n\n不到最后一秒你不知道谁才是赢家，以及没有什么不可能。\n\n电影最后三秒的绝杀简直让人心潮澎湃热血沸腾，想起了06年世锦赛王仕鹏最后5.8秒的三分球绝杀斯洛文尼亚，还有最近莱昂纳德精彩绝伦的绝杀，让多伦多猛龙以92比90险胜76人，以总比分4比3昂首挺进东部决赛书写历史。帅炸。\n以及电影最后那句“活着才一切皆有可能”，瞬间也可老泪纵横。\n有时候，一部电影，一场比赛一句台词就够了。\n          ——《绝杀慕尼黑》有感",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "太刺激了 后面忍不住鼓掌，然后鼓掌了还有观众迎合一起鼓掌。简直太激烈了",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "实在是太燃了，我一个对篮球完全没兴趣的看得热血沸腾",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "比《飞驰人生》强一百万倍！苏联队最后3秒逆转绝杀制胜美国队，尽管都知结局，但没想到如此一波三折、爆燃激动，儿子重病的教练、心脏病想放弃女友的队员、腿伤的10号核心、想叛逃某人，俄罗斯官僚带来压力，艰难困难时期的苏联折射，各类球迷都很幽默逗比，各种山穷水尽峰回路转，《夺命地铁》导演一气呵成震撼技巧超赞！“我打球的时候立陶宛整个街道都空无一人”",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "去TM的**政治，冷战，我是运动员！\n看完电影真TM想爆一句粗口。\n超燃的电影，特别最后的3秒钟，去裁判席投诉抗议的时候，最后一秒钟走完了，当全世界都认为他们输了，就连他们自己也这般认为，观众在欢呼庆祝，对手在欢呼庆祝，但是那个混蛋没有，那个混蛋光头教练没有，他依旧在抗议那本该给的三秒钟没有给，那个混蛋还真TM的给力，这才是TM体育精神，这才是一个运动员该有的基本素质——拼搏、永不言弃！\n本想说说当时前苏联的各种心酸，还有国际的紧张，那时候是冷战时期，但看到最后谁TM还关心政治，让TM的政治滚蛋吧，我只是个热爱运动、热爱篮球的人。\n提议，这部电影最适合跟最好的朋友组团去看。",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "真是太好看了，真的赞，特别是最后3秒长传底线2分苏联绝杀美国，最后的几秒里的时间剧情太煎熬，结局制造太悬念，还有就是美国街头那几个黑人小伙😂😂😂，赢了苏联人，苏联人又赢了美国队，所以他们才是最厉害的😂😂😂",
                "comment_time": "2019-6-21",
                "comment_rate": 9
            },
            {
                "comment_text": "体育竞技题材和歌舞片一样，都适合在影院观看。将配乐对于气氛的烘托最大化，才算真正意义上的观看了这部影片。\n \n本身便极具看点的素材加上曲折的比赛结果，故事在剧情上并不平淡，而俄罗斯电影人值得称赞的地方在于他们对于这次事件的加工处理极具火候。黑色幽默和紧张氛围之间的调度平衡、对前苏联官员的自黑也颇有力度，最为厉害的还是节奏的把控。\n\n最后，让我印象深刻的一个细节：前苏联老教练因为带球队输了一场比赛而离开球队，在和球员告别的时候，篮协的官员站在了篮球场边线内，作为新教练的加兰任拉住了篮协官员，把他拉到了身边，站在了边线外面。\n\n你在和你的队员告别，篮球场的每一寸都属于你，我只在篮球场外等候。",
                "comment_time": "2019-6-22",
                "comment_rate": 8
            },
            {
                "comment_text": "一段真实的历史，让人畅快淋漓，不能说毛子在黑美帝，而是确有其事，美帝脏还是出名的，这部类似卡特教练的路数，但是风格却不一样，这部注重于在球赛的表现上，在当中队员们相互成长，最重要的还是一个国家的荣耀！",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "太好看，激动的我手舞足蹈！！ 希望能票房大卖！！  那个教练，演的太好。  一个教练其实就是一个家长。 每个孩子都有自己的性格，和特长。 能把一个队伍带好，真不容易。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "激动人心，全无冷场，佳片；飾演教练那位仁兄，人品好極，征服了整支球队成员，赢尽人心，队员也被他感动，个个为他拼命。所以一个将领，是何等重要！",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "燃而历史，严肃而活泼，集体而个人，自黑又骄傲。",
                "comment_time": "2019-7-7",
                "comment_rate": 9.0
            },
            {
                "comment_text": "美国队不可战胜的神话，还是可以打破的。。。",
                "comment_time": "2019-7-6",
                "comment_rate": 7.0
            },
            {
                "comment_text": "大量的切镜和运动镜头，机位设定低，拍3/4个身子，最后3秒环绕全场的长镜头。弥补了一切非专业运动员还原经典的不足，漂亮。",
                "comment_time": "2019-7-4",
                "comment_rate": 8.0
            },
            {
                "comment_text": "非常燃~",
                "comment_time": "2019-7-4",
                "comment_rate": 9.0
            },
            {
                "comment_text": "镜头运用感觉棒，俄国片的笑点有点猝不及防。还有，在电影里面塞了场近乎完整的比赛，牛逼！",
                "comment_time": "2019-7-4",
                "comment_rate": 8.7
            }
        ]
    },
    {
        "id": 8,
        "url": "https://maoyan.com/films/1204589",
        "title": "绝杀慕尼黑",
        "other-title": "Движение вверх",
        "category": [
            "剧情",
            "运动"
        ],
        "release-location": "俄罗斯",
        "length": 121,
        "release-date": 2019,
        "director": [
            "安东·梅格尔季切夫"
        ],
        "actor": [
            "弗拉基米尔·马什科夫",
            "约翰·萨维奇",
            "伊万·科列斯尼科夫",
            "基里尔·扎耶采夫"
        ],
        "detail": "电影根据体育历史中著名的传奇真实事件改编，讲述了1972年慕尼黑奥运会篮球决赛中，前苏联篮球队打败了保持了36年全胜纪录的美国队的传奇故事。在决赛结束前三秒钟，美国队以一分优势领先。美国队已经开始提前庆祝比赛的胜利了，因为他们相信比赛结果已成定局。然而，一位来自苏联的不知名篮球教练，率领着艰难、困苦、贫穷中的苏联国家队，比赛结果发生逆转，整个篮球历史也发生了改变。",
        "img": "https://p0.meituan.net/movie/67044d5479f075a18adba35571cadc4f978021.jpg@464w_644h_1e_1c",
        "rating": 8.8,
        "hot-extent": {
            "video_num": 7,
            "photo_num": 88,
            "rating_num": 791,
            "news_num": 25
        },
        "comment": [
            {
                "comment_text": "去电影院里看场篮球赛吧。\n感受一下篮球的最大魅力：\n\n不到最后一秒你不知道谁才是赢家，以及没有什么不可能。\n\n电影最后三秒的绝杀简直让人心潮澎湃热血沸腾，想起了06年世锦赛王仕鹏最后5.8秒的三分球绝杀斯洛文尼亚，还有最近莱昂纳德精彩绝伦的绝杀，让多伦多猛龙以92比90险胜76人，以总比分4比3昂首挺进东部决赛书写历史。帅炸。\n以及电影最后那句“活着才一切皆有可能”，瞬间也可老泪纵横。\n有时候，一部电影，一场比赛一句台词就够了。\n          ——《绝杀慕尼黑》有感",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "太刺激了 后面忍不住鼓掌，然后鼓掌了还有观众迎合一起鼓掌。简直太激烈了",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "实在是太燃了，我一个对篮球完全没兴趣的看得热血沸腾",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "比《飞驰人生》强一百万倍！苏联队最后3秒逆转绝杀制胜美国队，尽管都知结局，但没想到如此一波三折、爆燃激动，儿子重病的教练、心脏病想放弃女友的队员、腿伤的10号核心、想叛逃某人，俄罗斯官僚带来压力，艰难困难时期的苏联折射，各类球迷都很幽默逗比，各种山穷水尽峰回路转，《夺命地铁》导演一气呵成震撼技巧超赞！“我打球的时候立陶宛整个街道都空无一人”",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "去TM的**政治，冷战，我是运动员！\n看完电影真TM想爆一句粗口。\n超燃的电影，特别最后的3秒钟，去裁判席投诉抗议的时候，最后一秒钟走完了，当全世界都认为他们输了，就连他们自己也这般认为，观众在欢呼庆祝，对手在欢呼庆祝，但是那个混蛋没有，那个混蛋光头教练没有，他依旧在抗议那本该给的三秒钟没有给，那个混蛋还真TM的给力，这才是TM体育精神，这才是一个运动员该有的基本素质——拼搏、永不言弃！\n本想说说当时前苏联的各种心酸，还有国际的紧张，那时候是冷战时期，但看到最后谁TM还关心政治，让TM的政治滚蛋吧，我只是个热爱运动、热爱篮球的人。\n提议，这部电影最适合跟最好的朋友组团去看。",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "真是太好看了，真的赞，特别是最后3秒长传底线2分苏联绝杀美国，最后的几秒里的时间剧情太煎熬，结局制造太悬念，还有就是美国街头那几个黑人小伙😂😂😂，赢了苏联人，苏联人又赢了美国队，所以他们才是最厉害的😂😂😂",
                "comment_time": "2019-6-21",
                "comment_rate": 9
            },
            {
                "comment_text": "体育竞技题材和歌舞片一样，都适合在影院观看。将配乐对于气氛的烘托最大化，才算真正意义上的观看了这部影片。\n \n本身便极具看点的素材加上曲折的比赛结果，故事在剧情上并不平淡，而俄罗斯电影人值得称赞的地方在于他们对于这次事件的加工处理极具火候。黑色幽默和紧张氛围之间的调度平衡、对前苏联官员的自黑也颇有力度，最为厉害的还是节奏的把控。\n\n最后，让我印象深刻的一个细节：前苏联老教练因为带球队输了一场比赛而离开球队，在和球员告别的时候，篮协的官员站在了篮球场边线内，作为新教练的加兰任拉住了篮协官员，把他拉到了身边，站在了边线外面。\n\n你在和你的队员告别，篮球场的每一寸都属于你，我只在篮球场外等候。",
                "comment_time": "2019-6-22",
                "comment_rate": 8
            },
            {
                "comment_text": "一段真实的历史，让人畅快淋漓，不能说毛子在黑美帝，而是确有其事，美帝脏还是出名的，这部类似卡特教练的路数，但是风格却不一样，这部注重于在球赛的表现上，在当中队员们相互成长，最重要的还是一个国家的荣耀！",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "太好看，激动的我手舞足蹈！！ 希望能票房大卖！！  那个教练，演的太好。  一个教练其实就是一个家长。 每个孩子都有自己的性格，和特长。 能把一个队伍带好，真不容易。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "激动人心，全无冷场，佳片；飾演教练那位仁兄，人品好極，征服了整支球队成员，赢尽人心，队员也被他感动，个个为他拼命。所以一个将领，是何等重要！",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "燃而历史，严肃而活泼，集体而个人，自黑又骄傲。",
                "comment_time": "2019-7-7",
                "comment_rate": 9.0
            },
            {
                "comment_text": "美国队不可战胜的神话，还是可以打破的。。。",
                "comment_time": "2019-7-6",
                "comment_rate": 7.0
            },
            {
                "comment_text": "大量的切镜和运动镜头，机位设定低，拍3/4个身子，最后3秒环绕全场的长镜头。弥补了一切非专业运动员还原经典的不足，漂亮。",
                "comment_time": "2019-7-4",
                "comment_rate": 8.0
            },
            {
                "comment_text": "非常燃~",
                "comment_time": "2019-7-4",
                "comment_rate": 9.0
            },
            {
                "comment_text": "镜头运用感觉棒，俄国片的笑点有点猝不及防。还有，在电影里面塞了场近乎完整的比赛，牛逼！",
                "comment_time": "2019-7-4",
                "comment_rate": 8.7
            }
        ]
    },
    {
        "id": 9,
        "url": "https://maoyan.com/films/1204589",
        "title": "绝杀慕尼黑",
        "other-title": "Движение вверх",
        "category": [
            "剧情",
            "运动"
        ],
        "release-location": "俄罗斯",
        "length": 121,
        "release-date": 2019,
        "director": [
            "安东·梅格尔季切夫"
        ],
        "actor": [
            "弗拉基米尔·马什科夫",
            "约翰·萨维奇",
            "伊万·科列斯尼科夫",
            "基里尔·扎耶采夫"
        ],
        "detail": "电影根据体育历史中著名的传奇真实事件改编，讲述了1972年慕尼黑奥运会篮球决赛中，前苏联篮球队打败了保持了36年全胜纪录的美国队的传奇故事。在决赛结束前三秒钟，美国队以一分优势领先。美国队已经开始提前庆祝比赛的胜利了，因为他们相信比赛结果已成定局。然而，一位来自苏联的不知名篮球教练，率领着艰难、困苦、贫穷中的苏联国家队，比赛结果发生逆转，整个篮球历史也发生了改变。",
        "img": "https://p0.meituan.net/movie/67044d5479f075a18adba35571cadc4f978021.jpg@464w_644h_1e_1c",
        "rating": 8.8,
        "hot-extent": {
            "video_num": 7,
            "photo_num": 88,
            "rating_num": 791,
            "news_num": 25
        },
        "comment": [
            {
                "comment_text": "去电影院里看场篮球赛吧。\n感受一下篮球的最大魅力：\n\n不到最后一秒你不知道谁才是赢家，以及没有什么不可能。\n\n电影最后三秒的绝杀简直让人心潮澎湃热血沸腾，想起了06年世锦赛王仕鹏最后5.8秒的三分球绝杀斯洛文尼亚，还有最近莱昂纳德精彩绝伦的绝杀，让多伦多猛龙以92比90险胜76人，以总比分4比3昂首挺进东部决赛书写历史。帅炸。\n以及电影最后那句“活着才一切皆有可能”，瞬间也可老泪纵横。\n有时候，一部电影，一场比赛一句台词就够了。\n          ——《绝杀慕尼黑》有感",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "太刺激了 后面忍不住鼓掌，然后鼓掌了还有观众迎合一起鼓掌。简直太激烈了",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "实在是太燃了，我一个对篮球完全没兴趣的看得热血沸腾",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "比《飞驰人生》强一百万倍！苏联队最后3秒逆转绝杀制胜美国队，尽管都知结局，但没想到如此一波三折、爆燃激动，儿子重病的教练、心脏病想放弃女友的队员、腿伤的10号核心、想叛逃某人，俄罗斯官僚带来压力，艰难困难时期的苏联折射，各类球迷都很幽默逗比，各种山穷水尽峰回路转，《夺命地铁》导演一气呵成震撼技巧超赞！“我打球的时候立陶宛整个街道都空无一人”",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "去TM的**政治，冷战，我是运动员！\n看完电影真TM想爆一句粗口。\n超燃的电影，特别最后的3秒钟，去裁判席投诉抗议的时候，最后一秒钟走完了，当全世界都认为他们输了，就连他们自己也这般认为，观众在欢呼庆祝，对手在欢呼庆祝，但是那个混蛋没有，那个混蛋光头教练没有，他依旧在抗议那本该给的三秒钟没有给，那个混蛋还真TM的给力，这才是TM体育精神，这才是一个运动员该有的基本素质——拼搏、永不言弃！\n本想说说当时前苏联的各种心酸，还有国际的紧张，那时候是冷战时期，但看到最后谁TM还关心政治，让TM的政治滚蛋吧，我只是个热爱运动、热爱篮球的人。\n提议，这部电影最适合跟最好的朋友组团去看。",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "真是太好看了，真的赞，特别是最后3秒长传底线2分苏联绝杀美国，最后的几秒里的时间剧情太煎熬，结局制造太悬念，还有就是美国街头那几个黑人小伙😂😂😂，赢了苏联人，苏联人又赢了美国队，所以他们才是最厉害的😂😂😂",
                "comment_time": "2019-6-21",
                "comment_rate": 9
            },
            {
                "comment_text": "体育竞技题材和歌舞片一样，都适合在影院观看。将配乐对于气氛的烘托最大化，才算真正意义上的观看了这部影片。\n \n本身便极具看点的素材加上曲折的比赛结果，故事在剧情上并不平淡，而俄罗斯电影人值得称赞的地方在于他们对于这次事件的加工处理极具火候。黑色幽默和紧张氛围之间的调度平衡、对前苏联官员的自黑也颇有力度，最为厉害的还是节奏的把控。\n\n最后，让我印象深刻的一个细节：前苏联老教练因为带球队输了一场比赛而离开球队，在和球员告别的时候，篮协的官员站在了篮球场边线内，作为新教练的加兰任拉住了篮协官员，把他拉到了身边，站在了边线外面。\n\n你在和你的队员告别，篮球场的每一寸都属于你，我只在篮球场外等候。",
                "comment_time": "2019-6-22",
                "comment_rate": 8
            },
            {
                "comment_text": "一段真实的历史，让人畅快淋漓，不能说毛子在黑美帝，而是确有其事，美帝脏还是出名的，这部类似卡特教练的路数，但是风格却不一样，这部注重于在球赛的表现上，在当中队员们相互成长，最重要的还是一个国家的荣耀！",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "太好看，激动的我手舞足蹈！！ 希望能票房大卖！！  那个教练，演的太好。  一个教练其实就是一个家长。 每个孩子都有自己的性格，和特长。 能把一个队伍带好，真不容易。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "激动人心，全无冷场，佳片；飾演教练那位仁兄，人品好極，征服了整支球队成员，赢尽人心，队员也被他感动，个个为他拼命。所以一个将领，是何等重要！",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "燃而历史，严肃而活泼，集体而个人，自黑又骄傲。",
                "comment_time": "2019-7-7",
                "comment_rate": 9.0
            },
            {
                "comment_text": "美国队不可战胜的神话，还是可以打破的。。。",
                "comment_time": "2019-7-6",
                "comment_rate": 7.0
            },
            {
                "comment_text": "大量的切镜和运动镜头，机位设定低，拍3/4个身子，最后3秒环绕全场的长镜头。弥补了一切非专业运动员还原经典的不足，漂亮。",
                "comment_time": "2019-7-4",
                "comment_rate": 8.0
            },
            {
                "comment_text": "非常燃~",
                "comment_time": "2019-7-4",
                "comment_rate": 9.0
            },
            {
                "comment_text": "镜头运用感觉棒，俄国片的笑点有点猝不及防。还有，在电影里面塞了场近乎完整的比赛，牛逼！",
                "comment_time": "2019-7-4",
                "comment_rate": 8.7
            }
        ]
    },
    {
        "id": 10,
        "url": "https://maoyan.com/films/1204589",
        "title": "绝杀慕尼黑",
        "other-title": "Движение вверх",
        "category": [
            "剧情",
            "运动"
        ],
        "release-location": "俄罗斯",
        "length": 121,
        "release-date": 2019,
        "director": [
            "安东·梅格尔季切夫"
        ],
        "actor": [
            "弗拉基米尔·马什科夫",
            "约翰·萨维奇",
            "伊万·科列斯尼科夫",
            "基里尔·扎耶采夫"
        ],
        "detail": "电影根据体育历史中著名的传奇真实事件改编，讲述了1972年慕尼黑奥运会篮球决赛中，前苏联篮球队打败了保持了36年全胜纪录的美国队的传奇故事。在决赛结束前三秒钟，美国队以一分优势领先。美国队已经开始提前庆祝比赛的胜利了，因为他们相信比赛结果已成定局。然而，一位来自苏联的不知名篮球教练，率领着艰难、困苦、贫穷中的苏联国家队，比赛结果发生逆转，整个篮球历史也发生了改变。",
        "img": "https://p0.meituan.net/movie/67044d5479f075a18adba35571cadc4f978021.jpg@464w_644h_1e_1c",
        "rating": 8.8,
        "hot-extent": {
            "video_num": 7,
            "photo_num": 88,
            "rating_num": 791,
            "news_num": 25
        },
        "comment": [
            {
                "comment_text": "去电影院里看场篮球赛吧。\n感受一下篮球的最大魅力：\n\n不到最后一秒你不知道谁才是赢家，以及没有什么不可能。\n\n电影最后三秒的绝杀简直让人心潮澎湃热血沸腾，想起了06年世锦赛王仕鹏最后5.8秒的三分球绝杀斯洛文尼亚，还有最近莱昂纳德精彩绝伦的绝杀，让多伦多猛龙以92比90险胜76人，以总比分4比3昂首挺进东部决赛书写历史。帅炸。\n以及电影最后那句“活着才一切皆有可能”，瞬间也可老泪纵横。\n有时候，一部电影，一场比赛一句台词就够了。\n          ——《绝杀慕尼黑》有感",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "太刺激了 后面忍不住鼓掌，然后鼓掌了还有观众迎合一起鼓掌。简直太激烈了",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "实在是太燃了，我一个对篮球完全没兴趣的看得热血沸腾",
                "comment_time": "2019-6-21",
                "comment_rate": 10
            },
            {
                "comment_text": "比《飞驰人生》强一百万倍！苏联队最后3秒逆转绝杀制胜美国队，尽管都知结局，但没想到如此一波三折、爆燃激动，儿子重病的教练、心脏病想放弃女友的队员、腿伤的10号核心、想叛逃某人，俄罗斯官僚带来压力，艰难困难时期的苏联折射，各类球迷都很幽默逗比，各种山穷水尽峰回路转，《夺命地铁》导演一气呵成震撼技巧超赞！“我打球的时候立陶宛整个街道都空无一人”",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "去TM的**政治，冷战，我是运动员！\n看完电影真TM想爆一句粗口。\n超燃的电影，特别最后的3秒钟，去裁判席投诉抗议的时候，最后一秒钟走完了，当全世界都认为他们输了，就连他们自己也这般认为，观众在欢呼庆祝，对手在欢呼庆祝，但是那个混蛋没有，那个混蛋光头教练没有，他依旧在抗议那本该给的三秒钟没有给，那个混蛋还真TM的给力，这才是TM体育精神，这才是一个运动员该有的基本素质——拼搏、永不言弃！\n本想说说当时前苏联的各种心酸，还有国际的紧张，那时候是冷战时期，但看到最后谁TM还关心政治，让TM的政治滚蛋吧，我只是个热爱运动、热爱篮球的人。\n提议，这部电影最适合跟最好的朋友组团去看。",
                "comment_time": "2019-6-20",
                "comment_rate": 10
            },
            {
                "comment_text": "真是太好看了，真的赞，特别是最后3秒长传底线2分苏联绝杀美国，最后的几秒里的时间剧情太煎熬，结局制造太悬念，还有就是美国街头那几个黑人小伙😂😂😂，赢了苏联人，苏联人又赢了美国队，所以他们才是最厉害的😂😂😂",
                "comment_time": "2019-6-21",
                "comment_rate": 9
            },
            {
                "comment_text": "体育竞技题材和歌舞片一样，都适合在影院观看。将配乐对于气氛的烘托最大化，才算真正意义上的观看了这部影片。\n \n本身便极具看点的素材加上曲折的比赛结果，故事在剧情上并不平淡，而俄罗斯电影人值得称赞的地方在于他们对于这次事件的加工处理极具火候。黑色幽默和紧张氛围之间的调度平衡、对前苏联官员的自黑也颇有力度，最为厉害的还是节奏的把控。\n\n最后，让我印象深刻的一个细节：前苏联老教练因为带球队输了一场比赛而离开球队，在和球员告别的时候，篮协的官员站在了篮球场边线内，作为新教练的加兰任拉住了篮协官员，把他拉到了身边，站在了边线外面。\n\n你在和你的队员告别，篮球场的每一寸都属于你，我只在篮球场外等候。",
                "comment_time": "2019-6-22",
                "comment_rate": 8
            },
            {
                "comment_text": "一段真实的历史，让人畅快淋漓，不能说毛子在黑美帝，而是确有其事，美帝脏还是出名的，这部类似卡特教练的路数，但是风格却不一样，这部注重于在球赛的表现上，在当中队员们相互成长，最重要的还是一个国家的荣耀！",
                "comment_time": "2019-6-20",
                "comment_rate": 9
            },
            {
                "comment_text": "太好看，激动的我手舞足蹈！！ 希望能票房大卖！！  那个教练，演的太好。  一个教练其实就是一个家长。 每个孩子都有自己的性格，和特长。 能把一个队伍带好，真不容易。",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "激动人心，全无冷场，佳片；飾演教练那位仁兄，人品好極，征服了整支球队成员，赢尽人心，队员也被他感动，个个为他拼命。所以一个将领，是何等重要！",
                "comment_time": "2019-6-22",
                "comment_rate": 10
            },
            {
                "comment_text": "燃而历史，严肃而活泼，集体而个人，自黑又骄傲。",
                "comment_time": "2019-7-7",
                "comment_rate": 9.0
            },
            {
                "comment_text": "美国队不可战胜的神话，还是可以打破的。。。",
                "comment_time": "2019-7-6",
                "comment_rate": 7.0
            },
            {
                "comment_text": "大量的切镜和运动镜头，机位设定低，拍3/4个身子，最后3秒环绕全场的长镜头。弥补了一切非专业运动员还原经典的不足，漂亮。",
                "comment_time": "2019-7-4",
                "comment_rate": 8.0
            },
            {
                "comment_text": "非常燃~",
                "comment_time": "2019-7-4",
                "comment_rate": 9.0
            },
            {
                "comment_text": "镜头运用感觉棒，俄国片的笑点有点猝不及防。还有，在电影里面塞了场近乎完整的比赛，牛逼！",
                "comment_time": "2019-7-4",
                "comment_rate": 8.7
            }
        ]
    },
];

//数组中是否包含某项
function isContains(arr, item){
    arr.map(function (ar) {
        if(ar === item){
            return true;
        }
    });
    return false;
}
//找到对应元素的索引
function catchIndex(arr, key){ //获取INDEX
    arr.map(function (ar, index) {
        if(ar.key === key){
            return index;
        }
    });
    return 0;
}
//替换数组的对应项
function replace(arr, item, place){ //arr 数组,item 数组其中一项, place 替换项
    arr.map(function (ar) {
        if(ar.key === item){
            arr.splice(arr.indexOf(ar),1,place)
        }
    });
    return arr;
}

export default class UForm extends Component{

    //movieName1 = [{key:"1",1:this.Result(0), 2:this.Result(1), 3:this.Result(2), 4:this.Result(3), 5:this.Result(4)},{key:"1",1:this.Result(0), 2:this.Result(1), 3:this.Result(2), 4:this.Result(3), 5:this.Result(4)}];
    //movieIndex=[{1:this.Result(0), 2:this.Result(1), 3:this.Result(2)}];
    movieIndex=[]
    //columns=[];
    columns = [{title:"",dataIndex:1,key:1},{title:"",dataIndex:2,key:2},{title:"",dataIndex:3,key:3},{title:"",dataIndex:4,key:4},{title:"",dataIndex:5,key:5}];
    movieName = []
    //movieName = [["肖申克的救赎", "盗梦空间", "阿甘正传", "机器人总动员", "教父"],["肖申克的救赎","盗梦空间","阿甘正传", "机器人总动员", "教父"]];
    // moviePic = [
    //         [
    //             "//img31.mtime.cn/mt/2014/03/07/123549.37376649_200X200X2.jpg",
    //             "//img31.mtime.cn/mg/2014/01/06/105513.87424776_200X200X2.jpg",
    //             "//img31.mtime.cn/mg/2014/06/17/145458.79721395_200X200X2.jpg",
    //             "//img31.mtime.cn/mt/2013/11/20/172527.42989246_200X200X2.jpg",
    //             "//img5.mtime.cn/mg/2017/01/24/151610.54986635_200X200X2.jpg"],
    //         [
    //             "//img31.mtime.cn/mt/2014/03/07/123549.37376649_200X200X2.jpg",
    //             "//img31.mtime.cn/mg/2014/01/06/105513.87424776_200X200X2.jpg",
    //             "//img31.mtime.cn/mg/2014/06/17/145458.79721395_200X200X2.jpg",
    //             "//img31.mtime.cn/mt/2013/11/20/172527.42989246_200X200X2.jpg",
    //             "//img5.mtime.cn/mg/2017/01/24/151610.54986635_200X200X2.jpg"]
    //         ];
    moviePic = []
    rating = []
    //rating = [[9.2,9.1,9.1,9.0,9.1],[9.2,9.1,9.1,9.0,9.1]];
    // actor = [["摩根·弗里曼, 蒂姆·罗宾斯","莱昂纳多·迪卡普里奥, 约瑟夫·高登-莱维特","汤姆·汉克斯, 罗宾·莱特","本·贝尔特, 艾丽莎·奈特","马龙·白兰度, 阿尔·帕西诺"],
    //                 ["摩根·弗里曼, 蒂姆·罗宾斯","莱昂纳多·迪卡普里奥, 约瑟夫·高登-莱维特","汤姆·汉克斯, 罗宾·莱特","本·贝尔特, 艾丽莎·奈特","马龙·白兰度, 阿尔·帕西诺"]
    //                 ];
    actor = []

    PrepareData() {
        var tempName=[];
        var tempUrl=[];
        var tempRating=[];
        var tempActor=[];
        for(var item in result){
            //console.log(result[item]["title"])
            if(result[item]["id"]%5==0){
                if(tempName.length>0){
                    this.movieName.push(tempName)
                    this.moviePic.push(tempUrl)
                    this.rating.push(tempRating)
                    this.actor.push(tempActor)
                }
                tempName=[]
                tempUrl=[]
                tempRating=[]
                tempActor=[]
            }
            tempName.push(result[item]["title"])
            tempUrl.push(result[item]["img"])
            tempRating.push(result[item]["rating"])
            var atr=""
            for(var a in result[item]["actor"]){
                //console.log(a)
                atr+=result[item]["actor"][a]+","
            }
            //console.log(atr)
            if(atr.length>0)
                atr = atr.substring(0,atr.length-1)
            tempActor.push(atr)
            //console.log(tempName)
        }
        if(tempName.length>0){
            this.movieName.push(tempName)
            this.moviePic.push(tempUrl)
            //console.log(tempRating)
            this.rating.push(tempRating)
            this.actor.push(tempActor)
        }
        //console.log(this.rating)
    }

    PrepareIndex() {
        var tempIndex={1:""};
        //console.log(tempIndex)
        for(var item in result){
            //console.log(result[item]["title"])
            //console.log(tempIndex)
            if(result[item]["id"]%5==0){
                if(tempIndex[1]!=""){
                    //console.log(this.movieIndex)
                    //console.log("1")
                    this.movieIndex.push(tempIndex)
                    //console.log(this.movieIndex)
                    //console.log("2")
                    //console.log("111")
                }
                tempIndex={1:""}
            }
            //console.log(tempName)
            tempIndex[result[item]["id"]%5+1]=this.Result(result[item]["id"])
        }
        //console.log(this.movieIndex)
        //console.log("3")
        if(tempIndex[1]!=""){
            //console.log(tempIndex)
            this.movieIndex.push(tempIndex)
        }
        //console.log(this.movieIndex)
        //console.log("4")
    }

    Result(index) {
        //let movieName = [["肖申克的救赎", "盗梦空间", "阿甘正传", "机器人总动员", "教父"],["肖申克的救赎","盗梦空间","阿甘正传", "机器人总动员", "教父"]];

        // let testUrl = [
        //     [
        //         "//img31.mtime.cn/mt/2014/03/07/123549.37376649_200X200X2.jpg",
        //         "//img31.mtime.cn/mg/2014/01/06/105513.87424776_200X200X2.jpg",
        //         "//img31.mtime.cn/mg/2014/06/17/145458.79721395_200X200X2.jpg",
        //         "//img31.mtime.cn/mt/2013/11/20/172527.42989246_200X200X2.jpg",
        //         "//img5.mtime.cn/mg/2017/01/24/151610.54986635_200X200X2.jpg"],
        //     [
        //         "//img31.mtime.cn/mt/2014/03/07/123549.37376649_200X200X2.jpg",
        //         "//img31.mtime.cn/mg/2014/01/06/105513.87424776_200X200X2.jpg",
        //         "//img31.mtime.cn/mg/2014/06/17/145458.79721395_200X200X2.jpg",
        //         "//img31.mtime.cn/mt/2013/11/20/172527.42989246_200X200X2.jpg",
        //         "//img5.mtime.cn/mg/2017/01/24/151610.54986635_200X200X2.jpg"]
        //     ];

        // let rating = [[9.2,9.1,9.1,9.0,9.1],[9.2,9.1,9.1,9.0,9.1]];
        //
        // let actor = [["摩根·弗里曼, 蒂姆·罗宾斯","莱昂纳多·迪卡普里奥, 约瑟夫·高登-莱维特","汤姆·汉克斯, 罗宾·莱特","本·贝尔特, 艾丽莎·奈特","马龙·白兰度, 阿尔·帕西诺"],
        //             ["摩根·弗里曼, 蒂姆·罗宾斯","莱昂纳多·迪卡普里奥, 约瑟夫·高登-莱维特","汤姆·汉克斯, 罗宾·莱特","本·贝尔特, 艾丽莎·奈特","马龙·白兰度, 阿尔·帕西诺"]
        //             ];


        // let re = movieName.map(function (item, index) {
        //     return (
        //         <Col md={6}>
        //             {/*链接到电影详情页*/}
        //             <a href='#' target="movie_window">
        //                 <Card
        //                     style={{marginBottom: 24, marginLeft: 6, marginRight: 6}}
        //                     bodyStyle={{padding: 0}}>
        //                     <div className='moviepost'>
        //                         <img src={testUrl} alt=""/>
        //                         <h2>{item}</h2>
        //                         <h3>"7.5分"</h3>
        //                         <div className='actors'>
        //                             <div className='actors-name'><strong>主演: </strong> 大幅度发斯蒂芬斯蒂芬水电费水电费{item}</div>
        //                         </div>
        //                     </div>
        //
        //                 </Card>
        //             </a>
        //         </Col>
        //     )
        // });
        //
        // return re;
        let row=Math.floor(index/5);
        let col=index%5;
        return (
            <Col md={24}>
                {/*链接到电影详情页*/}
                <a href='#' target="movie_window">
                    <Card
                        style={{marginBottom: 0, marginLeft: 0, marginRight: 0}}
                        bodyStyle={{padding: 0, height: '100%', width: '100%'}}>
                        <div className='moviepost'>
                            <img src={this.moviePic[row][col]} alt=""/>
                            <h2 >{this.movieName[row][col]}</h2>
                            <h3>{this.rating[row][col]}</h3>
                            <div className='actors' >
                                <div className='actors-name'><strong>主演: </strong> {this.actor[row][col]}</div>
                            </div>
                        </div>

                    </Card>
                </a>
            </Col>
        )
    }

    constructor(props) {
        super(props);
        this.state = {
            userName: '',
            address: '',
            timeRange: '',
            visible: false, //新建窗口隐藏
            dataSource: [],
            count: data.length,
            selectedRowKeys: [],
            tableRowKey: 0,
            isUpdate: false,
            loading: true,
            bloading : true,  //按钮等待状态
            size : 'default',  //按钮尺寸

            input: "",
            searchType: 0,
            movieData: []
        };

        this.btnSearch_Click = this.btnSearch_Click.bind(this);

    }

    makeLoading = ()=>{
        this.setState({bloading: true});
    }
    //取消按钮等待状态
    cancelLoading = ()=>{
        this.setState({bloading: false});
    }

    //改变按钮尺寸
    changeButtonSize = (e)=>{
        this.setState({size: e.target.value})
    }

    //getData
    getData = () => {
        axios.get('/data')
            .then(function (response) {
                // console.log(response.data);
                this.setState({
                    dataSource: response.data,
                    loading:false
                })
            }.bind(this))
            .catch(function (error) {
                console.log(error);
            })
    };
    //用户名输入
    onChangeUserName = (e) => {
        const value = e.target.value;
        this.setState({
            input: value,
        })
    };
    //用户名搜索
    onSearchUserName = (value) => {
        // console.log(value);
        const { dataSource } = this.state;
        this.setState({
            dataSource: dataSource.filter(item => item.name.indexOf(value) !== -1),
            loading: false,
        })
    };
    //地址级联选择
    Cascader_Select = (value) => {
        const { dataSource } = this.state;
        if(value.length===0){
            this.setState({
                address: value,
                dataSource: [],
            });
            this.getData();
        }else{
            this.setState({
                address: value,
                dataSource: dataSource.filter(item => item.address === value.join(' / '))
            });
        }
    };
    //时间选择
    RangePicker_Select = (date, dateString) => {
        // console.log(date, dateString);
        const { dataSource } = this.state;
        const startime = moment(dateString[0]);
        const endtime = moment(dateString[1]);
        if(date.length===0){
            this.setState({
                timeRange: date,
                dataSource: [],
            });
            this.getData();
        }else{
            this.setState({
                timeRange: date,
                dataSource: dataSource.filter(item => (moment(item.createtime.substring(0,10)) <= endtime  && moment(item.createtime.substring(0,10)) >= startime) === true)
            });
        }
    };
    //渲染
    componentDidMount(){
        axios.get('/address')
            .then(function (response) {
                response.data.map(function(province){
                    options.push({
                        value: province.name,
                        label: province.name
                        // children: province.name.map(function(city){
                        //     return {
                        //         value: city.name,
                        //         label: city.name,
                        //         children: city.area.map(function(area){
                        //             return {
                        //                 value: area,
                        //                 label: area,
                        //             }
                        //         })
                        //     }
                        // }),
                    })
                });
            })
            .catch(function (error) {
                console.log(error);
            });
        this.getData();
    }
    //搜索按钮
    async btnSearch_Click()  {

        let data = {...this.state};
        console.log(data);
        let res = await axios.post('http://127.0.0.1:8000/write/', data);
        console.log(res);

        this.setState({
            movieData: res.data
        })

        console.log(this.state);
    };
    //重置按钮
    btnClear_Click = () => {
        this.setState({
            userName: '',
            address: '',
            timeRange: '',
            dataSource: [],
            count: data.length,
        });
        this.getData();
    };
    //新建信息弹窗
    // CreateItem = () => {
    //     this.setState({
    //         visible: true,
    //         isUpdate: false,
    //     });
    //     const form = this.form;
    //     form.resetFields();
    // };
    // //接受新建表单数据
    // saveFormRef = (form) => {
    //     this.form = form;
    // };
    // //填充表格行
    // handleCreate = () => {
    //     const { dataSource, count } = this.state;
    //     const form = this.form;
    //     form.validateFields((err, values) => {
    //         if (err) {
    //             return;
    //         }
    //         console.log('Received values of form: ', values);
    //
    //         values.key = count;
    //         values.address = values.address.join(" / ");
    //         values.createtime = moment().format("YYYY-MM-DD hh:mm:ss");
    //
    //         form.resetFields();
    //         this.setState({
    //             visible: false,
    //             dataSource: [...dataSource, values],
    //             count: count+1,
    //         });
    //     });
    // };
    //取消
    handleCancel = () => {
        this.setState({ visible: false });
    };
    //批量删除
    MinusClick = () => {
        const { dataSource, selectedRowKeys } = this.state;
        this.setState({
            dataSource: dataSource.filter(item => !isContains(selectedRowKeys, item.key)),
        });
    };
    //单个删除
    onDelete = (key) => {
        const dataSource = [...this.state.dataSource];
        this.setState({ dataSource: dataSource.filter(item => item.key !== key) });
    };
    //点击修改
    editClick = (key) => {
        const form = this.form;
        const { dataSource } = this.state;
        const index = catchIndex(dataSource, key);
        form.setFieldsValue({
            key: key,
            name: dataSource[index].name,
            sex: dataSource[index].sex,
            age: dataSource[index].age,
            address: dataSource[index].address.split(' / '),
            phone: dataSource[index].phone,
            email: dataSource[index].email,
            website: dataSource[index].website,
        });
        this.setState({
            visible: true,
            tableRowKey: key,
            isUpdate: true,
        });
    };
    //更新修改
    handleUpdate = () => {
        const form = this.form;
        const { dataSource, tableRowKey } = this.state;
        form.validateFields((err, values) => {
            if (err) {
                return;
            }
            console.log('Received values of form: ', values);

            values.key = tableRowKey;
            values.address = values.address.join(" / ");
            values.createtime = moment().format("YYYY-MM-DD hh:mm:ss");

            form.resetFields();
            this.setState({
                visible: false,
                dataSource: replace(dataSource, tableRowKey, values)
            });
        });
    };
    //单选框改变选择
    checkChange = (selectedRowKeys) => {
        this.setState({selectedRowKeys: selectedRowKeys});
    };
    render(){
        const { userName, address, timeRange, dataSource, visible, isUpdate, loading, input } = this.state;
        const questiontxt = ()=>{
            return (
                <p>
                    <Icon type="plus-circle-o" /> : 新建信息<br/>
                    <Icon type="minus-circle-o" /> : 批量删除
                </p>
            )
        };

        if(flag==false) {
            this.PrepareData();
            this.PrepareIndex();
            flag=true
        }

        return(
            <div>
                <BreadcrumbCustom paths={['首页','搜索电影']}/>
                <div className='formBody' style = {{ }}>
                    <Row gutter={16} className = 'A'>
                        <Col className="gutter-row" sm={3} >
                            <InputGroup compact>
                                <Cascader style={{ width: '100%' }} options={options} placeholder="选择搜索方式" onChange={this.Cascader_Select} value={address}/>
                            </InputGroup>
                        </Col>
                        <Col className="gutter-row" sm={12}>
                            <Search
                                placeholder="精确搜索电影/导演/艺人"
                                // prefix={<Icon type="user" />}
                                value={input}
                                onChange={this.onChangeUserName}
                                onSearch={this.onSearchUserName}
                            />
                        </Col>
                        <Col className='btnOpera'>
                            <Button type="primary" onClick={this.btnSearch_Click} style={{marginLeft:'10px'}}>查询</Button>
                            {/*<Button type="primary" onClick={this.btnClear_Click} style={{background:'#f8f8f8', color: '#108ee9'}}>重置</Button>*/}
                        </Col>

                    </Row>
                    <Row gutter={16} className = 'B' >
                        {/*<Col className="gutter-row" sm={8}>*/}
                        {/*    <InputGroup compact>*/}
                        {/*        <Cascader style={{ width: '100%' }} options={options} placeholder="Select Address" onChange={this.Cascader_Select} value={address}/>*/}
                        {/*    </InputGroup>*/}
                        {/*</Col>*/}
                        {/*<Col className="gutter-row" sm={8}>*/}
                        {/*    <RangePicker style={{ width:'100%' }} onChange={this.RangePicker_Select} value={timeRange}/>*/}
                        {/*</Col>*/}
                        {/*<div className='plus' onClick={this.CreateItem}>*/}
                        {/*    <Icon type="plus-circle" />*/}
                        {/*</div>*/}
                        {/*<div className='minus'>*/}
                        {/*    <Popconfirm title="确定要批量删除吗?" onConfirm={this.MinusClick}>*/}
                        {/*        <Icon type="minus-circle" />*/}
                        {/*    </Popconfirm>*/}
                        {/*</div>*/}
                        {/*<div className='question'>*/}
                        {/*    <Tooltip placement="right" title={questiontxt}>*/}
                        {/*        <Icon type="question-circle" />*/}
                        {/*    </Tooltip>*/}
                        {/*</div>*/}
                        {/*<div className = 'A'>*/}
                            {/*<Card title="普通的按钮">*/}
                            {/*    <Button> 无样式按钮 </Button>*/}
                                {/*<Button type="primary"> 主题颜色的按钮 </Button>*/}
                                {/*<Button type="dashed"> 虚线按钮 </Button>*/}
                                {/*<Button type="danger"> 危险按钮 </Button>*/}
                                {/*<Button disabled> 被禁用的按钮 </Button>*/}
                            {/*</Card>*/}

                            {/*icon:指定按钮图标
          shape:指定按钮形状*/}
                            {/*<Card title="带图形的按钮">*/}
                            {/*    <Button icon="plus" type="primary">新建</Button>*/}
                            {/*    <Button icon="edit" type="primary">编辑</Button>*/}
                            {/*    <Button icon="save" type="primary">保存</Button>*/}
                            {/*    <Button icon="delete" type="danger">删除</Button>*/}
                            {/*    <Button icon="download" type="primary">导出</Button>*/}
                            {/*    <Button icon="search" shape="circle"></Button>*/}
                            {/*    <Button icon="search">查询</Button>*/}
                            {/*</Card>*/}

                            {/*loading:等待状态，true为等待中 */}
                            {/*<Card title="点击保存就锁定的按钮">*/}
                            {/*    <Button loading={this.state.loading} icon="plus" type="primary">新建</Button>*/}
                            {/*    <Button loading={this.state.loading} icon="edit" type="primary">编辑</Button>*/}
                            {/*    <Button loading={this.state.loading} icon="delete" type="danger">删除</Button>*/}
                            {/*    <Button loading={this.state.loading} icon="save" type="primary" onClick={this.makeLoading}>保存</Button>*/}
                            {/*    <Button icon="delete" type="primary" onClick={this.cancelLoading}>取消等待</Button>*/}
                            {/*</Card>*/}

                            {/*<Card title="把两个按钮组装在一起">*/}
                            {/*    <Button.Group>*/}
                            {/*        <Button icon="left" type="primary">上一步</Button>*/}
                            {/*        <Button icon="right" type="primary">下一步</Button>*/}
                            {/*    </Button.Group>*/}
                            {/*</Card>*/}

                            {/*/!*size:按钮尺寸*!/*/}
                            {/*<Card title="尺寸可变的按钮">*/}
                            {/*    <Radio.Group value={this.state.size} onChange={this.changeButtonSize}> /!*单选组*!/*/}
                            {/*        <Radio value="large">大</Radio>*/}
                            {/*        <Radio value="default">中</Radio>*/}
                            {/*        <Radio value="small">小</Radio>*/}
                            {/*    </Radio.Group>*/}
                            {/*    <Button size={this.state.size} icon="plus" type="primary">新建</Button>*/}
                            {/*    <Button size={this.state.size} icon="edit" type="primary">编辑</Button>*/}
                            {/*    <Button size={this.state.size} icon="delete" type="danger">删除</Button>*/}
                            {/*</Card>*/}
                        {/*</div>*/}
                        <text>按年代分：</text>
                        <Button> 所有年代 </Button>
                        <Button> 60年代前 </Button>
                        <Button> 70年代 </Button>
                        <Button> 80年代 </Button>
                        <Button> 90年代 </Button>
                        <Button> 2000-2010 </Button>
                        <Button> 2011至今 </Button>
                    </Row>

                    <Row gutter={16} className = 'B' >
                        <text>按类型分：</text>
                        <Button bloading='true'> 所有类型 </Button>
                        <Button> 科幻 </Button>
                        <Button> 喜剧 </Button>
                        <Button> 动作 </Button>
                        <Button> 爱情 </Button>
                        <Button> 伦理 </Button>
                        <Button> 灾难 </Button>
                    </Row>
                    {/*<FormTable*/}
                    {/*    dataSource={dataSource}*/}
                    {/*    checkChange={this.checkChange}*/}
                    {/*    onDelete={this.onDelete}*/}
                    {/*    editClick={this.editClick}*/}
                    {/*    loading={loading}*/}
                    {/*/>*/}
                    {/*{isUpdate?*/}
                    {/*    <CollectionCreateForm ref={this.saveFormRef} visible={visible} onCancel={this.handleCancel} onCreate={this.handleUpdate} title="修改信息" okText="更新"*/}
                    {/*/> : <CollectionCreateForm ref={this.saveFormRef} visible={visible} onCancel={this.handleCancel} onCreate={this.handleCreate} title="新建信息" okText="创建"*/}
                    {/*/>}*/}
                    <div>
                        <BreadcrumbCustom paths={['首页']}/>
                        <div className='mindex'>
                            <Row gutter={2}>
                                <Table pagination={true} pagination={{pageSize:2}} dataSource={this.movieIndex} columns={this.columns} showHeader={false} />
                            </Row>
                        </div>
                    </div>
                </div>
            </div>

        )
    }
}